R=eval(input("请输入半径："))
S=3.1415*R*R
L=2*2.1415*R
print("面积和周长：",S,L)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
R=eval(input("输入实数："))
if (R<0):
    R=-R
print("绝对值：",R)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
R=eval(input("请输入正整数："))
i,s=1,0
while (i<=R):
    s=s+i
    i=i+1
print("累和",s)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
R=eval(input("请输入正整数："))
i,s=1,1
while (i<=R):
    s=s*i
    i=i+1
print("阶乘",s)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
PM=eval(input("请输入PM2.5数值："))
if 0<=PM<35:
    print("空气优质，快去户外运动！")
if 35<=PM<75:
    print("空气良好，适度户外运动！")
if 75<=PM:
    print("空气污染，请小心！")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
PM=eval(input("请输入PM2.5数值："))
if PM>=75:
    print("空气存在污染，请小心！")
else:
    print("空气没有污染，可以开展户外运动！")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
year=eval(input("输入年份："))
if (year%4==0 and year%100!=0) or (year%400==0):
    print(year,"：闰年")
else:
    print(year,"：非闰年")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
PM=eval(input("请输入PM2.5数值："))
print("空气{}污染！".format("存在"if PM>=75 else "没有"))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
PM=eval(input("请输入PM2.5数值："))
if 0<=PM<35:
    print("空气优质，快去户外运动！")
elif 35<=PM<75:
    print("空气良好，适度户外运动！")
else:
    print("空气污染，请小心！")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
x=eval(input("请输入x:"))
if x<0:
    y=abs(x)
elif x<15:
    y=exp(x)*cos(x)
elif x<30:
    y=pow(x,5)
else:
    y=(7+9*x)*log(x)
print("y=",y)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
x=eval(input("请输入x:"))
if x<15:
    if x<0:
        y=abs(x)
    else:
        y=exp(x)*cos(x)
else:
    if x<30:
        y=pow(x,5)
    else:
        y=(7+9*x)*log(x)
print("y=",y)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
height,weight=eval(input("请输入身高（米）和体重（公斤）[逗号隔开]:"))
bmi=weight/pow(height,2)
print("BMI数值为：{:.2f}".format(bmi))
wto,dom="",""
if bmi<18.5:
    wto="偏瘦"
elif bmi<25:
    wto="正常"
elif bmi<30:
    wto="偏胖"
else:
    wto="肥胖"
if bmi<18.5:
    dom="偏瘦"
elif bmi<24:
    dom="正常"
elif bmi<28:
    dom="偏胖"
else:
    dom="肥胖"
print("BMI指标为：国际'{0}',国内'{1}'".format(wto,dom))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
height,weigth=eval(input("请输入身高（米）和体重（公斤）[逗号隔开]:"))
bmi=weight/pow(height,2)
print("BMI数值为：{:.2f}".format(bmi))
wto,dom="",""
if bmi<18.5:
    wto,dom="偏瘦","偏瘦"
elif 18.5<=bmi<24:
    wto,dom="正常","正常"
elif 24<=bmi<25:
    wto,dom="正常","偏胖"
elif 25<=bmi<28:
    wto,dom="偏胖","偏胖"
elif 28<=bmi<30:
    wto,bmi="偏胖","肥胖"
else:
    wto,dom="肥胖","肥胖"
print("BMI指标为：国际'{0}',国内'{1}'".format(wto,dom))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
s=["XYZ","HELLO","ABC","PYTHON"]
for i in s:
    print(i)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
s=["XYZ","HELLO","ABC","PYTHON"]
for i in range(len(s)):
    print(i,s[i])
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
for s in "BIT":
    print("循环进行中："+s)
else:
    s="循环正常结束"
print(s)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
s,idx="BIT",0
while idx<len(s):
    print("循环进行中："+s[idx])
    idx +=1
else:
    s="循环正常结束"
print(s)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print()
for i in range(1,10):
    for j in range(1,10):
        print(i*j,end='\t')
    print()
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print()
i=1
while i<=9:
    j=1
    while j<=i:
        print(i*j,end='\t')
        j=j+1
    i=i+1
    print()
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
for s in "BIT":
    for i in range(10):
        print(s,end="")
        if s=="I":
            break
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
x=eval(input("请输入一个数："))
i=2
while i<=int(sqrt(x)):
    if x%i==0:
        break
    i=i+1
if i>int(sqrt(x)):
    print(x,":质数")
else:
    print(x,":非质数")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
x=eval(input("请输入一个数："))
for i in range(2,0):
    if x%i==0:
        break
if i>=x-1:
    print(x,":质数")
else:
    print(x,":非质数")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
for s in "PYTHON":
    if s=="T":
        continue
    print(s,end="")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
for s in "PYTHON":
    if s=="T":
        break
    print(s,end="")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
s=0
for i in range(1,11):
    if i%2==0:
        continue
    if i%10==7:
        break
    s=s+i
print("s=",s)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
for s in "PYTHON":
    if s=="T":
        continue
    print(s,end="")
else:
    print("正常退出")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
for s in "PYTHON":
    if s=="T":
        break
    print(s,end="")
else:
    print("正常退出")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from random import*
ls=list(range(10))
print(ls)
shuffle(ls)
print(ls)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
seed(125)
print("{}.{}.{}".format(randint(1,10),randint(1,10),randint(1,10)))
print("{}.{}.{}".format(randint(1,10),randint(1,10),randint(1,10)))
seed(125)
print("{}.{}.{}".format(randint(1,10),randint(1,10),randint(1,10)))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from random import random
from math import sqrt
from time import perf_counter
DARTS=1000
hits=0.0
perf_counter()
for i in range(1,DARTS+1):
    x,y=random(),random()
    dist=sqrt(x**2+y**2)
    if dist <=1.0:
        hits=hits+1
pi=4*(hits/DARTS)
print("pi值是{}.".format(pi))
print("运行时间是：{:5.5}s".format(perf_counter()))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
num=eval(input("请输入一个整数："))
print(num**2)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
try:
    num=eval(input("请输入一个整数："))
    print(num**2)
except NameError:
    print("输入错误，请输入一个整数！")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
try:
    alp="ABCDEFGHIJKLMNOPQRSTUVWXYZ"
    idx=eval(input("请输入一个整数："))
    print(alp[idx])
except NameError:
    print("输入错误，请输入一个整数！")
except:
    print("其他错误")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
try:
    alp="ABCDEFGHIJKLMNOPQRSTUVWXYZ"
    idx=eval(input("请输入一个整数："))
    print(alp[idx])
except NameError:
    print("输入错误，请输入一个整数！")
else:
    print("没有发生异常")
finally:
    print("程序执行完毕，不知道是否发生了异常")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print()
a,b=0,1
for i in range(20):
    if (i+1)%5!=0:
        print(a,end='\t')
    else:
        print(a,end='\n')
    a,b=b,a+b
print()
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
m=3
s=0
while m<100:
    k=int(sqrt(m))
    i=2
    while i<=k:
        if m%i==0:
            break
        i=i+1
    else:
        print(m,end='\t')
        s=s+m
    m=m+2
print("\n2-100之间所有素数之和：",s)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print("公鸡数","母鸡数","小鸡数",sep='\t')
for x in range(1,20):
    for y in range(1,32):
        z=100-x-y
        if 5*x+3*y+z/3==100:
            print(x,y,z,sep='\t')
