print ("h")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
sum=9999*9999
print(sum)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
months="janfebmaraprmayjunaugsepoctnovdec"
n=4
monthabbrev=months[(n-1)*3:(n-1)*3+3]
print(monthabbrev)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
def mean(numbers):
    s=0.0
    for num in numbers:
        s=s+num
        return s / len(numbers)
nums=[0,1,2,3,4,5,6,7,8,9]
print(mean(nums))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from random import random     #from random import* 和 from random import random 有什么区别？
rnd=random()*10
print(rnd)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
radius=25
area=2.1415*radius*radius
print("{:.2f}".format(area))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
name=input("输入姓名：")
print("{}同学，学好python,前途无量！".format(name))
print("{}大侠，学好python,前途无量！".format(name[0]))
print("{}哥哥，学好python,前途无量！".format(name[1:]))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
a,b=0,1
while a<1000:
    print(a,end=',')
    a,b=b,a+b
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from turtle import*     #为什么不能用 from turtle import turtle 代替 from turtle import*  ?
speed(10)
pensize(2)
circle(10)
circle(40)
circle(80)
circle(160)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from datetime import*     #from datetime import* 和 from datetime import datetime 有什么区别？
now=datetime.now()
print(now)
now.strftime("%X")
now.strftime("%x")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------