a=pow(2,10)
b=pow(2,15)
c=pow(2,1000)
d=pow(2,b)
print(a,b,c,d)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
dayup=pow((1+0.001),365)
daydown=pow((1-0.001),365)
print("up:{:.2f},down:{:.2f}".format(dayup,daydown))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
dayup=pow((1+0.005),365)
daydown=pow((1-0.005),365)
print("up:{:.2f},down:{:.2f}".format(dayup,daydown))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from math import*
dayfactor=0.01
dayup=pow((1+dayfactor),365)
daydown=pow((1-dayfactor),365)
print("up:{:.2f},down:{:.2f}".format(dayup,daydown))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
dayup,dayfactor=1,0.01
for i in range(365):
    if i%7 in[6,0]:
        dayup=dayup*(1-dayfactor)
    else:
        dayup=dayup*(1+dayfactor)
print("up5dayd,down2day:{:.2f}".format(dayup))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
def dayUp(df):
    dayup=1
    for i in range(365):
        if i%7 in [6,0]:
            dayup=dayup*(1-0.01*df)
        else:
            dayup=dayup*(1+0.01*df)
    return dayup
dayfactor=0.01
while (dayUp(dayfactor)<37.78):
    dayfactor +=0.001
print("每天努力的参数是：{:.3f}".format(dayfactor))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print("\"大家好\"")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
greet="Hello John"
print(greet[2])
x=8
print(greet[x-2])
print(greet[-4])
print(greet[0:3])
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
x="pine"+"apple"
print(x,", pine"+"apple")
print("pine"+"apple")
print(3*"pine")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
weekstr="星期一星期二星期三星期四星期五星期六星期日"
weekid=eval(input("请输入星期数字（1-7）："))
pos=(weekid-1)*3
print(weekstr[pos:pos+3])
'''
也可以这样：
weekstr="星期一星期二星期三星期四星期五星期六星期日"
n=input("请输入星期数（1-7）：")
pos=(int(n)-1)*3
weekAbbrev=weekstr[pos:pos+3]
print("星期简写是"+weekAbbrev+".")
'''
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
months="JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC"
n=input("请输入月份数（1-12）：")
pos=(int(n)-1)*3
monthAbbrev=months[pos:pos+3]
print("月份简写是"+monthAbbrev+".")
'''
也可以这样：
months="JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC"
monthid=eval(input("请输入月份数字（1-12）："))
pos=(monthid-1)*3
print(months[pos:pos+3])
'''
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print(len("pine"))
print(len("祖国，您好!"))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print(str(123))
print(str(123.456))
print(str(123e+10))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print("Hello\nWorld\n\nGoodbye 32\n")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
plaincode=input("请输入明文：")
for p in plaincode:
    if ord("a")<=ord(p)<=ord("z"):
        print(chr(ord("a")+(ord(p)-ord("a")+3)%26),end='')
    else:
        print(p,end='')
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
print("{:>15s}:{:<8.2f}".format("length",23.87501))
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
from time import*
scale=10
print("-----执行开始-----")
for i in range(scale+1):
    a,b='**'*i,'..'*(scale-i)
    c=(i/scale)*100
    print("%{:3.0f}[{}->{}]".format(c,a,b))
    sleep(0.1)
print("-----执行结束-----")
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
import time
for i in range(101):
    print("\r{:2}%".format(i),end=" ")
    time.sleep(0.05)
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
import time
scale=50
print("执行开始".center(scale//2,'-'))
t = time.perf_counter()              #或者 time.process_time()
for i in range(scale+1):
    a='*'*i
    b='.'*(scale-i)
    c=(i/scale)*100
    t -= time.perf_counter()      #或者 time.process_time()
    print("\r{:^3.0f}%[{}->{}]{:.2f}s".format(c,a,b,-t),\
          end='')
    time.sleep(0.05)
print("\n"+"执行结束".center(scale//2,'-'))
#有问题↑
#----------------------------------------------------------
print("                   ")
#----------------------------------------------------------
